Revit 2027 API
MechanicalFitting Properties
The MechanicalFitting type exposes the following members.
Properties
Name | Description
ConnectorManager |  Retrieves the Connector Manager from this MEPModel.
(Inherited from MEPModel)
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from MEPModel)
PartType | The part type of the mechanical fitting.
Top
See Also
Reference
MechanicalFitting Class
Autodesk.Revit.DB.Mechanical Namespace